In [4]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('../data/interim/retail.db')

In [5]:
pd.read_sql('SELECT * FROM sales LIMIT 5', conn)

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [1]:
import sqlite3
import pandas as pd

# Connect to your database
conn = sqlite3.connect('../data/interim/retail.db')

# Check connection works
df = pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)
df

    name
0  sales

In [2]:
pd.read_sql("PRAGMA table_info('sales')", conn)

   cid   name     type  notnull dflt_value  pk
0    0   date     TEXT        0       None   0
1    1  store  INTEGER        0       None   0
2    2   item  INTEGER        0       None   0
3    3  sales  INTEGER        0       None   0

In [3]:
pd.read_sql("SELECT * FROM sales LIMIT 5", conn)

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [4]:
pd.read_sql("""
    SELECT store, SUM(sales) as total_sales
    FROM sales
    GROUP BY store
    ORDER BY total_sales DESC
    LIMIT 5
""", conn)

   store  total_sales
0      2       943732
1      8       787449
2      3       745232
3     10       720123
4      9       676693

In [5]:
# Look at the first 5 rows
df_sales = pd.read_sql("SELECT * FROM retail_sales LIMIT 5;", conn)
df_sales

DatabaseError: Execution failed on sql 'SELECT * FROM retail_sales LIMIT 5;': no such table: retail_sales

In [6]:
pd.read_sql("""
SELECT store, item, COUNT(*) as record_count
FROM retail_sales
GROUP BY store, item
ORDER BY record_count DESC
LIMIT 10;
""", conn)

DatabaseError: Execution failed on sql '
SELECT store, item, COUNT(*) as record_count
FROM retail_sales
GROUP BY store, item
ORDER BY record_count DESC
LIMIT 10;
': no such table: retail_sales

In [7]:
df_sales = pd.read_sql("SELECT * FROM sales LIMIT 5;", conn)
df_sales

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [8]:
sqlite-utils insert data/interim/retail.db sales data/raw/retail_sales_sample.csv --csv

SyntaxError: invalid syntax (958716766.py, line 1)

In [9]:
df_sales = pd.read_sql("SELECT * FROM sales LIMIT 5;", conn)
df_sales

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [10]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('data/interim/retail.db')

# See column names and types
schema = pd.read_sql("PRAGMA table_info(sales);", conn)
schema

OperationalError: unable to open database file

In [11]:
import os
os.getcwd()

'/Users/charlesroyes/Projects/retail-sales-analytics-portfolio/notebooks'

In [12]:
import sqlite3
import pandas as pd

# Correct relative path from notebooks/
conn = sqlite3.connect('../data/interim/retail.db')

# Test reading the table info
pd.read_sql("PRAGMA table_info(sales);", conn)

   cid   name     type  notnull dflt_value  pk
0    0   date     TEXT        0       None   0
1    1  store  INTEGER        0       None   0
2    2   item  INTEGER        0       None   0
3    3  sales  INTEGER        0       None   0

In [13]:
import os
os.getcwd()

'/Users/charlesroyes/Projects/retail-sales-analytics-portfolio/notebooks'

In [14]:
pd.read_sql("SELECT * FROM sales LIMIT 5;", conn)

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [15]:
pd.read_sql("SELECT COUNT(*) AS total_records FROM sales;", conn)

   total_records
0         149999

In [16]:
pd.read_sql("""
SELECT 
    SUM(CASE WHEN date IS NULL THEN 1 ELSE 0 END) AS missing_date,
    SUM(CASE WHEN store IS NULL THEN 1 ELSE 0 END) AS missing_store,
    SUM(CASE WHEN item IS NULL THEN 1 ELSE 0 END) AS missing_item,
    SUM(CASE WHEN sales IS NULL THEN 1 ELSE 0 END) AS missing_sales
FROM sales;
""", conn)

   missing_date  missing_store  missing_item  missing_sales
0             0              0             0              0

In [17]:
pd.read_sql("""
SELECT store, SUM(sales) AS total_sales, AVG(sales) AS avg_sales
FROM sales
GROUP BY store
ORDER BY total_sales DESC;
""", conn)

   store  total_sales  avg_sales
0      2       943732  57.425581
1      8       787449  53.905326
2      3       745232  50.099630
3     10       720123  49.296481
4      9       676693  46.323453
5      4       674761  46.191197
6      1       665977  40.524340
7      5       488624  33.449069
8      6       487905  33.399849
9      7       446709  30.579751

In [18]:
pd.read_sql("""
SELECT substr(date, 1, 7) AS month, SUM(sales) AS monthly_sales
FROM sales
GROUP BY month
ORDER BY month;
""", conn)

      month  monthly_sales
0   2013-01          63896
1   2013-02          65003
2   2013-03          87375
3   2013-04          96270
4   2013-05         107526
5   2013-06         112629
6   2013-07         120371
7   2013-08         108272
8   2013-09          96659
9   2013-10          91436
10  2013-11          96693
11  2013-12          70281
12  2014-01          72915
13  2014-02          73142
14  2014-03          98025
15  2014-04         109954
16  2014-05         122461
17  2014-06         126279
18  2014-07         137433
19  2014-08         122640
20  2014-09         108672
21  2014-10         105024
22  2014-11         110863
23  2014-12          80491
24  2015-01          76679
25  2015-02          76466
26  2015-03         101929
27  2015-04         114799
28  2015-05         128578
29  2015-06         130660
30  2015-07         143066
31  2015-08         128215
32  2015-09         114753
33  2015-10         110485
34  2015-11         114744
35  2015-12          84297
36  2016-01          83364
37  2016-02          85399
38  2016-03         109542
39  2016-04         125629
40  2016-05         137360
41  2016-06         142311
42  2016-07         158454
43  2016-08         136169
44  2016-09         124252
45  2016-10         120243
46  2016-11         123590
47  2016-12          92142
48  2017-01          85590
49  2017-02          86181
50  2017-03         113672
51  2017-04         130754
52  2017-05         141529
53  2017-06         148200
54  2017-07         162788
55  2017-08         142043
56  2017-09         129788
57  2017-10         123409
58  2017-11         128948
59  2017-12          96867